#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.vpc_flowlog_policy: Reading...
data.aws_iam_policy_document.assume_role: Reading...
aws_vpc.this: Refreshing state... [id=vpc-0870bffca2421a1e1]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3760307347]
data.aws_iam_policy_document.vpc_flowlog_policy: Read complete after 0s [id=3442509011]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cw_loggroup will be created
  + resource "aws_cloudwatch_log_group" "cw_loggroup" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "example"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # aws_flow_log.app1 will be created
  + resource "aws_flow_log" "app1" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = (known after apply)
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0870bffca2421a1e1"
    }

  # aws_iam_role.vpc_flowlog_role will be created
  + resource "aws_iam_role" "vpc_flowlog_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc_flowlog_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.vpc_flowlog_role will be created
  + resource "aws_iam_role_policy" "vpc_flowlog_role" {
      + id     = (known after apply)
      + name   = "vpc_flowlog_role"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kunduso-aws, Action: `pull_request`*